#include<stdio.h>
//5. 1부터 100까지 더하는 함수를 만들되,
//1 + 2 + 3..... + 100 = 5050 이라는 메시지도 출력해주는 함수
//만들기(단 5050값은 반환해준다)
//1 + 2 + 3 + 4 + 5 + 6 + 7 + 8 + 9 + 10 + 11 + 12 + 13 + 14 + 15 + 16 + 17 + 18 + 19 + 20 + 21 + 22 + 23 + 24 + 25 + 26 + 27 + 28 + 29 + 30 + 31 + 32 + 33 + 34 + 35 + 36 + 37 +
//38 + 39 + 40 + 41 + 42 + 43 + 44 + 45 + 46 + 47 + 48 + 49 + 50 + 51 + 52 + 53 + 54 + 55 + 56 + 57 + 58 + 59 + 60 + 61 + 62 + 63 + 64 + 65 + 66 + 67 + 68 + 69 + 70 + 71 +
//72 + 73 + 74 + 75 + 76 + 77 + 78 + 79 + 80 + 81 + 82 + 83 + 84 + 85 + 86 + 87 + 88 + 89 + 90 + 91 + 92 + 93 + 94 + 95 + 96 + 97 + 98 + 99 + 100
//total = 5050

int sumsum()
{
	int sum = 0;
	for (int i = 1; i <= 100; i++)
	{
		sum += i;
		if (i == 100)
			printf(" %d = %d",i, sum);
		else
		printf(" %d +", i);
	}
	printf("\n");
	return sum;
}


int main()
{
	int result = sumsum();
	printf(" %d ", result);

	printf("The sum of numbers 1 to 100 = %d\n", sumsum());
	return 0;
}



